Repository: Geoege-xll/quotio
Catalog: Quotio/Localizable.xcstrings
Source language: en
Languages: fr, vi, zh_hans, zh_hant

source: %lld percent
fr: %lld pour cent
vi: %lld phần trăm
zh_hans: %lld 百分比

# about.description
source: %@ is a native macOS application for managing CLIProxyAPI - a local proxy server that powers your AI coding agents. Manage multiple AI accounts, track quotas, and configure CLI tools in one place.
fr: %@ est une application macOS native pour gérer CLIProxyAPI - un serveur proxy local qui alimente vos agents de codage IA. Gérez plusieurs comptes IA, suivez les quotas et configurez les outils CLI en un seul endroit.
vi: %@ là ứng dụng macOS để quản lý CLIProxyAPI - máy chủ proxy cục bộ hỗ trợ các AI coding agent. Quản lý nhiều tài khoản AI, theo dõi hạn mức và cấu hình các công cụ CLI tại một nơi.
zh_hans: %@ 是一个原生 macOS 应用程序，用于管理 CLIProxyAPI - 一个为您的 AI 编码代理提供支持的本地代理服务器。在一个地方管理多个 AI 账户、跟踪配额和配置 CLI 工具。

# about.madeWith
source: Made with ❤️ in Vietnam
fr: Fait avec ❤️ au Vietnam
vi: Được tạo với ❤️ tại Việt Nam
zh_hans: 用 ❤️ 在越南制作

# about.support
source: Support Us
fr: Nous soutenir
vi: Ủng hộ
zh_hans: 支持我们

# about.tagline
source: Your AI Coding Command Center
fr: Votre centre de commande IA pour le code
vi: Trung tâm điều khiển AI Coding của bạn
zh_hans: 您的 AI 编码指挥中心

source: Accounts
fr: Comptes
vi: Tài khoản
zh_hans: 账户

# action.cancel
source: Cancel
fr: Annuler
vi: Hủy
zh_hans: 取消

# action.clear
source: Clear
fr: Effacer
vi: Xóa
zh_hans: 清除

# action.close
source: Close
fr: Fermer
vi: Đóng
zh_hans: 关闭

# action.connect
source: Connect
fr: Connecter
vi: Kết nối
zh_hans: 连接

# action.copy
source: Copy
fr: Copier
vi: Sao chép
zh_hans: 复制

# action.copyAll
source: Copy All
fr: Tout copier
vi: Sao chép tất cả
zh_hans: 全部复制

# action.copyCode
source: Copy Code
fr: Copier le code
vi: Sao chép mã
zh_hans: 复制代码

# action.create
source: Create
fr: Créer
vi: Tạo
zh_hans: 创建

# action.delete
source: Delete
fr: Supprimer
vi: Xóa
zh_hans: 删除

# action.dismiss
source: Dismiss
fr: Fermer
vi: Ẩn
zh_hans: 关闭

# action.done
source: Done
fr: Terminé
vi: Xong
zh_hans: 完成

# action.download
source: Download
fr: Télécharger
vi: Tải xuống
zh_hans: 下载

# action.edit
source: Edit
fr: Modifier
vi: Sửa
zh_hans: 编辑

# action.openApp
source: Open Quotio
fr: Ouvrir Quotio
vi: Mở Quotio
zh_hans: 打开 Quotio

# action.quit
source: Quit Quotio
fr: Quitter Quotio
vi: Thoát Quotio
zh_hans: 退出 Quotio

# action.reconnect
source: Reconnect
fr: Reconnecter
vi: Kết nối lại
zh_hans: 重新连接

# action.refresh
source: Refresh
fr: Actualiser
vi: Làm mới
zh_hans: 刷新

# action.refreshQuota
source: Refresh Quota
fr: Actualiser le quota
vi: Làm mới Quota
zh_hans: 刷新配额

# action.rename
source: Rename
fr: Renommer
vi: Đổi tên
zh_hans: 重命名

# action.retry
source: Retry
fr: Réessayer
vi: Thử lại
zh_hans: 重试

# action.save
source: Save
fr: Enregistrer
vi: Lưu
zh_hans: 保存

# action.start
source: Start
fr: Démarrer
vi: Bắt đầu
zh_hans: 开始

# action.startProxy
source: Start Proxy
fr: Démarrer le proxy
vi: Khởi động Proxy
zh_hans: 启动代理

# action.stop
source: Stop
fr: Arrêter
vi: Dừng
zh_hans: 停止

# action.stopProxy
source: Stop Proxy
fr: Arrêter le proxy
vi: Dừng Proxy
zh_hans: 停止代理

# action.switch
source: Switch
fr: Changer
vi: Chuyển
zh_hans: 切换

# action.update
source: Update
fr: Mettre à jour
vi: Cập nhật
zh_hans: 更新

# action.upload
source: Upload Auth File
fr: Téléverser un fichier d'auth
vi: Tải lên file auth
zh_hans: 上传认证文件

# action.warmup
source: WarmUP
fr: Préchauffer
vi: Làm nóng
zh_hans: 预热

# agents.amp.configSuccess
source: Configuration files created. Amp CLI is now configured to use CLIProxyAPI.
fr: Les fichiers de configuration ont été créés. Amp CLI est maintenant configuré pour utiliser CLIProxyAPI.
vi: Đã tạo các tệp cấu hình. Amp CLI hiện được cấu hình để sử dụng CLIProxyAPI.
zh_hans: 配置文件已创建。Amp CLI 现已配置为使用 CLIProxyAPI。

# agents.amp.mergeAndSaveFiles
source: Merge only the properties below into the existing files, or use environment variables. Do not replace existing Amp settings or secrets:
fr: Fusionnez uniquement les propriétés ci-dessous dans les fichiers existants, ou utilisez les variables d’environnement. Ne remplacez pas les réglages ou secrets Amp existants :
vi: Chỉ gộp các thuộc tính bên dưới vào các tệp hiện có hoặc sử dụng biến môi trường. Không thay thế cài đặt hay thông tin bí mật Amp hiện có:
zh_hans: 仅将以下属性合并到现有文件中，或改用环境变量。请勿替换现有的 Amp 设置或密钥：

# agents.amp.mergeSecrets
source: Merge this property into ~/.local/share/amp/secrets.json; do not replace existing AmpCode credentials
fr: Fusionnez cette propriété dans ~/.local/share/amp/secrets.json ; ne remplacez pas les identifiants AmpCode existants
vi: Gộp thuộc tính này vào ~/.local/share/amp/secrets.json; không thay thế thông tin đăng nhập AmpCode hiện có
zh_hans: 将此属性合并到 ~/.local/share/amp/secrets.json；请勿替换现有的 AmpCode 凭据

# agents.amp.mergeSettings
source: Merge this property into ~/.config/amp/settings.json; do not replace the file
fr: Fusionnez cette propriété dans ~/.config/amp/settings.json ; ne remplacez pas le fichier
vi: Gộp thuộc tính này vào ~/.config/amp/settings.json; không thay thế tệp
zh_hans: 将此属性合并到 ~/.config/amp/settings.json；请勿替换该文件

# agents.amp.useEnvironmentVariables
source: Or add these environment variables instead
fr: Ou ajoutez plutôt ces variables d’environnement
vi: Hoặc thêm các biến môi trường này thay thế
zh_hans: 或者改为添加这些环境变量

# agents.apiKey
source: API Key
fr: Clé API
vi: Khóa API
zh_hans: API 密钥

# agents.apply
source: Apply
fr: Appliquer
vi: Áp dụng
zh_hans: 应用

# agents.availableBackups
source: %lld available
fr: %lld disponible
vi: %lld có sẵn
zh_hans: %lld 可用

# agents.backups.delete
source: Delete…
fr: Supprimer…
vi: Xóa…
zh_hans: 删除…

# agents.backups.deleteConfirm
source: Delete selected backups?
fr: Supprimer les sauvegardes sélectionnées ?
vi: Xóa các bản sao lưu đã chọn?
zh_hans: 删除所选备份？

# agents.backups.deleteConfirmMessage
source: Move %ld backups to Trash. The current configuration will stay unchanged.
fr: Placer %ld sauvegardes dans la corbeille. La configuration actuelle restera inchangée.
vi: Chuyển %ld bản sao lưu vào Thùng rác. Cấu hình hiện tại không thay đổi.
zh_hans: 将 %ld 个备份移到废纸篓，当前配置不会改变。

# agents.backups.deleteFailed
source: Could not delete backups: %@
fr: Impossible de supprimer les sauvegardes : %@
vi: Không thể xóa bản sao lưu: %@
zh_hans: 无法删除备份：%@

# agents.backups.deleteSelected
source: Delete selected (%ld)
fr: Supprimer la sélection (%ld)
vi: Xóa mục đã chọn (%ld)
zh_hans: 删除所选（%ld）

# agents.backups.invalidBackup
source: This file is not a removable configuration backup.
fr: Ce fichier n’est pas une sauvegarde de configuration supprimable.
vi: Tệp này không phải là bản sao lưu cấu hình có thể xóa.
zh_hans: 该文件不是可删除的配置备份。

# agents.backups.moveToTrash
source: Move to Trash
fr: Placer dans la corbeille
vi: Chuyển vào Thùng rác
zh_hans: 移到废纸篓

# agents.backups.selectToDelete
source: Select the backups to move to Trash. You can recover them from Trash.
fr: Sélectionnez les sauvegardes à placer dans la corbeille. Vous pourrez les y récupérer.
vi: Chọn bản sao lưu để chuyển vào Thùng rác. Bạn có thể khôi phục từ Thùng rác.
zh_hans: 勾选要删除的备份。删除后可从废纸篓恢复。

# agents.codex.authJSONMergeKey
source: Add this key to ~/.codex/auth.json, keeping any entries already in the file:
fr: Ajoutez cette clé à ~/.codex/auth.json en conservant les entrées déjà présentes dans le fichier :
vi: Thêm khóa này vào ~/.codex/auth.json, giữ nguyên các mục đã có trong tệp:
zh_hans: 将此密钥添加到 ~/.codex/auth.json，并保留文件中已有的条目：

# agents.codex.mergeAndSaveFiles
source: Merge and save the files below in ~/.codex/ directory:
fr: Fusionnez et enregistrez les fichiers ci-dessous dans le répertoire ~/.codex/ :
vi: Gộp và lưu các tệp bên dưới vào thư mục ~/.codex/:
zh_hans: 合并并将以下文件保存到 ~/.codex/ 目录：

# agents.codex.revertManualInstructions
source: Remove the [model_providers.cliproxyapi] section from ~/.codex/config.toml, and remove the Quotio-managed OPENAI_API_KEY entry from ~/.codex/auth.json while keeping the other entries in that file.
fr: Supprimez la section [model_providers.cliproxyapi] de ~/.codex/config.toml, puis supprimez l'entrée OPENAI_API_KEY gérée par Quotio de ~/.codex/auth.json en conservant les autres entrées de ce fichier.
vi: Xóa phần [model_providers.cliproxyapi] khỏi ~/.codex/config.toml, và xóa mục OPENAI_API_KEY do Quotio quản lý khỏi ~/.codex/auth.json trong khi vẫn giữ các mục khác trong tệp đó.
zh_hans: 从 ~/.codex/config.toml 中移除 [model_providers.cliproxyapi] 部分，并从 ~/.codex/auth.json 中移除由 Quotio 管理的 OPENAI_API_KEY 条目，同时保留该文件中的其他条目。

# agents.configFailed
source: Configuration failed
fr: Échec de la configuration
vi: Cấu hình thất bại
zh_hans: 配置失败

# agents.configMode
source: Configuration Mode
fr: Mode de configuration
vi: Chế độ cấu hình
zh_hans: 配置模式

# agents.configSuccess
source: Configuration complete!
fr: Configuration terminée !
vi: Cấu hình hoàn tất!
zh_hans: 配置完成！

# agents.configure
source: Configure
fr: Configurer
vi: Cấu hình
zh_hans: 配置

# agents.configured
source: Configured
fr: Configuré
vi: Đã cấu hình
zh_hans: 已配置

# agents.connectionInfo
source: Connection Info
fr: Informations de connexion
vi: Thông tin kết nối
zh_hans: 连接信息

# agents.currentlyDefault
source: Currently: Default
fr: Actuel : Par défaut
vi: Hiện tại: Mặc định
zh_hans: 当前：默认

# agents.currentlyProxy
source: Currently: Proxy
fr: Actuel : Proxy
vi: Hiện tại: Proxy
zh_hans: 当前：代理

# agents.defaultModel
source: Default model
fr: Modèle par défaut
vi: Mô hình mặc định
zh_hans: 默认模型

# agents.defaultModel.claudeInfo
source: Choose the model used when Claude Code starts. Follow a slot to use its mapping, or select a specific model.
fr: Choisissez le modèle au démarrage de Claude Code. Suivez un emplacement pour utiliser sa correspondance, ou sélectionnez un modèle précis.
vi: Chọn mô hình khi Claude Code khởi động. Theo một ô để dùng ánh xạ của ô đó, hoặc chọn mô hình cụ thể.
zh_hans: 选择 Claude Code 启动时使用的模型。可跟随下方模型槽，也可直接指定具体模型。

# agents.defaultModel.codexInfo
source: Save the model ID or proxy alias Codex CLI uses at startup. Codex's /model menu uses its own catalog; saving here does not add proxy models to that menu. Saved selections are kept when absent from the refreshed list.
fr: Enregistrez l’ID du modèle ou l’alias du proxy utilisé au démarrage de Codex CLI. Son menu /model utilise son propre catalogue ; cet enregistrement n’y ajoute pas les modèles du proxy. Les choix enregistrés sont conservés même s’ils sont absents de la liste actualisée.
vi: Lưu ID mô hình hoặc bí danh proxy dùng khi Codex CLI khởi động. Menu /model của Codex dùng danh mục riêng; lưu tại đây không thêm mô hình proxy vào menu đó. Lựa chọn đã lưu vẫn được giữ khi không có trong danh sách làm mới.
zh_hans: 保存 Codex CLI 启动时使用的模型 ID 或代理别名。Codex 的 /model 菜单使用独立目录，此处保存不会把代理模型加入该菜单。已保存的选择会保留，即使刷新后的列表中暂时没有它。

# agents.defaultModel.followSlot
source: Follow %@ slot
fr: Suivre le modèle %@
vi: Theo ô mô hình %@
zh_hans: 跟随 %@ 槽

# agents.defaultSetup
source: Default Setup
fr: Configuration par défaut
vi: Thiết lập mặc định
zh_hans: 默认设置

# agents.defaultSetup.info
source: This will remove Quotio proxy configuration and restore the agent to use its default provider endpoints. Your other settings (permissions, MCP servers, etc.) will be preserved.
fr: Cela supprimera la configuration proxy de Quotio et rétablira l'agent pour utiliser les points de terminaison par défaut de son fournisseur. Vos autres réglages (autorisations, serveurs MCP, etc.) seront conservés.
vi: Thao tác này sẽ xóa cấu hình proxy Quotio và khôi phục agent về các endpoint mặc định của nhà cung cấp. Các cài đặt khác của bạn (quyền, máy chủ MCP, v.v.) sẽ được giữ nguyên.
zh_hans: 此操作将移除 Quotio 代理配置，并将代理恢复为使用其提供商的默认端点。你的其他设置（权限、MCP 服务器等）将被保留。

# agents.filesModified
source: Files Modified
fr: Fichiers modifiés
vi: Các tệp đã thay đổi
zh_hans: 已修改的文件

# agents.installed
source: Installed
fr: Installé
vi: Đã cài đặt
zh_hans: 已安装

# agents.modelMapping.defaultNameInfo
source: The startup name follows the selected model or role. Claude Code manages the Default menu title.
fr: Le nom suit le modèle ou le rôle choisi. Claude Code gère le titre du menu Par défaut.
vi: Tên khởi động theo mô hình hoặc vai trò đã chọn. Claude Code quản lý tiêu đề mục mặc định.
zh_hans: 名称随所选模型或角色显示；Claude Code 的 Default 菜单标题由客户端管理。

# agents.modelMapping.defaultOneMillionInfo
source: A specific model has its own 1M setting. A linked role inherits that role’s setting. Disabling an explicit role[1m] selection returns to the role’s setting.
fr: Un modèle précis a son propre réglage 1M. Un rôle lié hérite du sien. Désactiver un choix explicite rôle[1m] rétablit le réglage du rôle.
vi: Mô hình cụ thể có tùy chọn 1M riêng. Khi theo vai trò, tùy chọn được kế thừa. Tắt lựa chọn vai trò[1m] sẽ trở về tùy chọn của vai trò.
zh_hans: 指定模型时独立设置 1M；跟随角色时继承该角色的设置。关闭显式角色[1m]选择后，恢复跟随该角色。

# agents.modelMapping.defaultRole
source: Default
fr: Par défaut
vi: Mặc định
zh_hans: 默认

# agents.modelMapping.displayName
source: Display name
fr: Nom affiché
vi: Tên hiển thị
zh_hans: 显示名称

# agents.modelMapping.displayNameInfo
source: Display names do not change request routing. Leave blank to use the model ID.
fr: Le nom affiché ne change pas le routage. Laissez vide pour utiliser l’identifiant du modèle.
vi: Tên hiển thị không thay đổi mô hình gửi yêu cầu. Để trống để dùng ID mô hình.
zh_hans: 显示名称不改变请求目标；留空时使用实际模型 ID。

# agents.modelMapping.gatewayModels
source: Show other gateway models in /model
fr: Afficher les autres modèles de la passerelle dans /model
vi: Hiển thị các mô hình gateway khác trong /model
zh_hans: 在 /model 中显示其他网关模型

# agents.modelMapping.gatewayModelsInfo
source: Adds models from the proxy, which may use compatibility names. Restart Claude Code after saving.
fr: Ajoute les modèles du proxy, qui peuvent utiliser des noms de compatibilité. Redémarrez Claude Code après enregistrement.
vi: Thêm mô hình từ proxy, có thể dùng tên tương thích. Khởi động lại Claude Code sau khi lưu.
zh_hans: 开启后还会列出代理提供的模型，部分代理使用兼容名称。保存后重启 Claude Code 生效。

# agents.modelMapping.inherited
source: Linked
fr: Hérité
vi: Kế thừa
zh_hans: 继承

# agents.modelMapping.preview
source: /model slot completion preview
fr: Aperçu des complétions des rôles /model
vi: Xem trước gợi ý vai trò /model
zh_hans: /model 模型槽补全预览

# agents.modelMapping.previewInfo
source: The picker uses your display names. Command completion keeps the role names and shows their model details.
fr: Le sélecteur utilise vos noms d’affichage. La complétion conserve les noms des rôles et affiche les détails des modèles.
vi: Bộ chọn dùng tên hiển thị của bạn. Gợi ý lệnh giữ tên vai trò và hiển thị thông tin mô hình.
zh_hans: 模型选择面板使用你填写的显示名称；命令补全保留角色名，并显示对应的模型说明。

# agents.modelMapping.requestModel
source: Request model
fr: Modèle des requêtes
vi: Mô hình gửi yêu cầu
zh_hans: 实际请求模型

# agents.modelMapping.role
source: Model role
fr: Rôle du modèle
vi: Vai trò mô hình
zh_hans: 模型角色

# agents.modelMapping.startup
source: Startup
fr: Démarrage
vi: Khởi động
zh_hans: 启动模型

# agents.models.refresh
source: Refresh model list
fr: Actualiser les modèles
vi: Làm mới danh sách mô hình
zh_hans: 刷新模型列表

# agents.modelSlots
source: Model Slots
fr: Emplacements de modèle
vi: Slot mô hình
zh_hans: 模型槽

# agents.notInstalled
source: Not Installed
fr: Non installé
vi: Chưa cài đặt
zh_hans: 未安装

# agents.opencode.notConfigured
source: No Quotio provider found in opencode.json. OpenCode already uses its default providers.
fr: Aucun fournisseur Quotio trouvé dans opencode.json. OpenCode utilise déjà ses fournisseurs par défaut.
vi: Không tìm thấy nhà cung cấp Quotio trong opencode.json. OpenCode đang dùng các nhà cung cấp mặc định.
zh_hans: 在 opencode.json 中未找到 Quotio 提供商。OpenCode 已在使用其默认提供商。

# agents.opencode.parseError.duplicateKey
source: The key "%@" appears more than once.
fr: La clé « %@ » apparaît plusieurs fois.
vi: Khóa "%@" xuất hiện nhiều lần.
zh_hans: 键“%@”出现了多次。

# agents.opencode.parseError.notObject
source: The file is not a JSON object.
fr: Le fichier n’est pas un objet JSON.
vi: Tệp không phải là một đối tượng JSON.
zh_hans: 该文件不是 JSON 对象。

# agents.opencode.parseError.notUTF8
source: The file is not valid UTF-8 text.
fr: Le fichier n’est pas un texte UTF-8 valide.
vi: Tệp không phải là văn bản UTF-8 hợp lệ.
zh_hans: 该文件不是有效的 UTF-8 文本。

# agents.opencode.parseError.providerNotObject
source: The "provider" field is not a JSON object.
fr: Le champ « provider » n’est pas un objet JSON.
vi: Trường "provider" không phải là một đối tượng JSON.
zh_hans: “provider” 字段不是 JSON 对象。

# agents.opencode.parseError.syntax
source: Unexpected character at line %1$@, column %2$@.
fr: Caractère inattendu à la ligne %1$@, colonne %2$@.
vi: Ký tự không hợp lệ tại dòng %1$@, cột %2$@.
zh_hans: 第 %1$@ 行第 %2$@ 列存在意外字符。

# agents.opencode.parseError.unterminatedComment
source: A block comment (/* …) is never closed.
fr: Un commentaire de bloc (/* …) n’est jamais fermé.
vi: Một chú thích khối (/* …) chưa được đóng.
zh_hans: 块注释（/* …）未闭合。

# agents.opencode.parseError.unterminatedString
source: A text value is missing its closing quote.
fr: Une valeur texte n’a pas de guillemet fermant.
vi: Một giá trị văn bản thiếu dấu nháy đóng.
zh_hans: 文本值缺少结束引号。

# agents.opencode.parseError.verification
source: The edited file did not match the expected result, so nothing was written.
fr: Le fichier modifié ne correspond pas au résultat attendu ; rien n’a été écrit.
vi: Tệp sau khi chỉnh sửa không khớp với kết quả mong đợi nên không có gì được ghi.
zh_hans: 编辑后的文件与预期结果不符，因此未写入任何内容。

# agents.opencode.parseFailed
source: Could not parse %1$@: %2$@ The file was left untouched — fix its syntax and try again, or use manual mode.
fr: Impossible d’analyser %1$@ : %2$@ Le fichier n’a pas été modifié — corrigez sa syntaxe puis réessayez, ou utilisez le mode manuel.
vi: Không thể phân tích %1$@: %2$@ Tệp được giữ nguyên — hãy sửa cú pháp rồi thử lại, hoặc dùng chế độ thủ công.
zh_hans: 无法解析 %1$@：%2$@ 文件未被修改 — 请修正其语法后重试，或使用手动模式。

# agents.pi.statusHelp
source: Installed means the Pi executable was found. Configured means Pi is connected to CPA through Quotio. Signing in to another provider does not change this status.
fr: Installé signifie que l’exécutable Pi a été détecté. Configuré signifie que Pi est connecté à CPA via Quotio. La connexion à un autre fournisseur ne change pas cet état.
vi: Đã cài đặt nghĩa là đã tìm thấy tệp thực thi Pi. Đã cấu hình nghĩa là Pi đã kết nối với CPA qua Quotio. Đăng nhập vào nhà cung cấp khác không thay đổi trạng thái này.
zh_hans: 已安装表示已找到 Pi 可执行文件；已配置表示已通过 Quotio 接入 CPA。Pi 登录其他提供商不会改变此接入状态。
zh_hant: 已安裝表示已找到 Pi 執行檔；已設定表示已透過 Quotio 接入 CPA。Pi 登入其他供應商不會改變此接入狀態。

# agents.proxyRemovalWarning
source: Current proxy configuration will be removed
fr: La configuration proxy actuelle sera supprimée
vi: Cấu hình proxy hiện tại sẽ bị xóa
zh_hans: 当前代理配置将被移除

# agents.proxyURL
source: Proxy URL
fr: URL du proxy
vi: URL Proxy
zh_hans: 代理 URL

# agents.rawConfigs
source: Raw Configurations
fr: Configurations brutes
vi: Cấu hình thô
zh_hans: 原始配置

# agents.reasoningEffort
source: Reasoning Effort
fr: Effort de raisonnement
vi: Mức độ suy luận
zh_hans: 推理强度

# agents.reasoningEffort.custom
source: %@ (custom)
fr: %@ (personnalisé)
vi: %@ (tùy chỉnh)
zh_hans: %@（自定义）

# agents.reasoningEffort.high
source: High
fr: Élevé
vi: Cao
zh_hans: 高

# agents.reasoningEffort.info
source: Sets model_reasoning_effort for Codex CLI. Higher levels improve answer quality but respond slower and use more quota.
fr: Définit model_reasoning_effort pour Codex CLI. Les niveaux élevés améliorent la qualité des réponses mais sont plus lents et consomment plus de quota.
vi: Thiết lập model_reasoning_effort cho Codex CLI. Mức cao hơn cải thiện chất lượng trả lời nhưng phản hồi chậm hơn và tốn nhiều hạn mức hơn.
zh_hans: 设置 Codex CLI 的 model_reasoning_effort。等级越高回答质量越好，但响应更慢且消耗更多配额。

# agents.reasoningEffort.low
source: Low
fr: Faible
vi: Thấp
zh_hans: 低

# agents.reasoningEffort.max
source: Max
fr: Maximum
vi: Tối đa
zh_hans: 最大

# agents.reasoningEffort.medium
source: Medium
fr: Moyen
vi: Trung bình
zh_hans: 中

# agents.reasoningEffort.none
source: None
fr: Aucun
vi: Không
zh_hans: 无

# agents.reasoningEffort.xhigh
source: Extra High
fr: Très élevé
vi: Rất cao
zh_hans: 超高

# agents.reconfigure
source: Reconfigure
fr: Reconfigurer
vi: Cấu hình lại
zh_hans: 重新配置

# agents.restoreAction
source: Restore
fr: Restaurer
vi: Khôi phục
zh_hans: 恢复

# agents.restoreBackup
source: Restore from Backup
fr: Restaurer depuis la sauvegarde
vi: Khôi phục từ bản sao lưu
zh_hans: 从备份恢复

# agents.restoreBackup.confirm.message
source: This will replace the current configuration with the selected backup.
fr: Cela remplacera la configuration actuelle par la sauvegarde sélectionnée.
vi: Thao tác này sẽ thay thế cấu hình hiện tại bằng bản sao lưu đã chọn.
zh_hans: 此操作将使用所选备份替换当前配置。

# agents.restoreBackup.confirm.title
source: Restore Backup?
fr: Restaurer la sauvegarde ?
vi: Khôi phục bản sao lưu?
zh_hans: 恢复备份？

# agents.restoreBackup.info
source: Restoring a backup will replace the current configuration with the selected backup.
fr: La restauration d'une sauvegarde remplacera la configuration actuelle par la sauvegarde sélectionnée.
vi: Việc khôi phục bản sao lưu sẽ thay thế cấu hình hiện tại bằng bản sao lưu đã chọn.
zh_hans: 恢复备份会使用所选备份替换当前配置。

# agents.saveConfig
source: Save Config
fr: Enregistrer la configuration
vi: Lưu cấu hình
zh_hans: 保存配置

# agents.setup.default
source: Default (Direct)
fr: Par défaut (direct)
vi: Mặc định (trực tiếp)
zh_hans: 默认（直连）

# agents.setup.default.desc
source: Use provider's default endpoint
fr: Utiliser le point de terminaison par défaut du fournisseur
vi: Sử dụng endpoint mặc định của nhà cung cấp
zh_hans: 使用提供商的默认端点

# agents.setup.proxy.desc
source: Route requests through Quotio proxy
fr: Acheminer les requêtes via le proxy Quotio
vi: Định tuyến yêu cầu qua proxy Quotio
zh_hans: 通过 Quotio 代理转发请求

# agents.setupMode
source: Setup Mode
fr: Mode de configuration
vi: Chế độ thiết lập
zh_hans: 设置模式

# agents.storage.both
source: Both
fr: Les deux
vi: Cả hai
zh_hans: 两者

# agents.storage.jsonOnly
source: JSON Config
fr: Config JSON
zh_hans: JSON 配置

# agents.storage.shellOnly
source: Shell Profile
fr: Profil Shell
zh_hans: Shell 配置文件

# agents.storageOption
source: Storage Location
fr: Emplacement de stockage
vi: Vị trí lưu trữ
zh_hans: 存储位置

# agents.subtitle
source: Configure CLI agents to use CLIProxyAPI
fr: Configurer les agents CLI pour utiliser CLIProxyAPI
vi: Cấu hình CLI agent để sử dụng CLIProxyAPI
zh_hans: 配置 CLI 代理以使用 CLIProxyAPI

# agents.test
source: Test Connection
fr: Tester la connexion
vi: Kiểm tra kết nối
zh_hans: 测试连接

# agents.testConnection
source: Test Connection
fr: Tester la connexion
vi: Kiểm tra kết nối
zh_hans: 测试连接

# agents.title
source: Agent Configuration
fr: Configuration des agents IA
vi: Cài đặt AI Agent
zh_hans: 智能体配置
zh_hant: 智慧體設定

# agents.useOAuth
source: Use OAuth Authentication
fr: Utiliser l'authentification OAuth
vi: Sử dụng xác thực OAuth
zh_hans: 使用 OAuth 认证

# agents.useOAuthDesc
source: Use your existing Google OAuth credentials
fr: Utiliser vos identifiants Google OAuth existants
vi: Sử dụng thông tin đăng nhập Google OAuth hiện có
zh_hans: 使用您现有的 Google OAuth 凭据

# agents.viewDocs
source: View Docs
fr: Voir la documentation
vi: Xem tài liệu
zh_hans: 查看文档

# amp.apiKey.hint
source: Stored securely in Keychain and never shown again.
fr: Stocké en toute sécurité dans le trousseau et ne sera plus jamais affiché.
vi: Được lưu an toàn trong Keychain và không hiển thị lại.
zh_hans: 安全存储在钥匙串中，之后不会再次显示。

# amp.apiKey.label
source: Amp Access Token
fr: Jeton d’accès Amp
vi: Mã truy cập Amp
zh_hans: Amp 访问令牌

# amp.apiKey.placeholder
source: Enter your Amp access token
fr: Saisissez votre jeton d’accès Amp
vi: Nhập mã truy cập Amp
zh_hans: 输入您的 Amp 访问令牌
